# 라이브러리 불러오기

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

# 0.Pandas 자료 구조 이해하기
## numpy는 다차원(n th Dimension) 지원해준다. but pandas는 1차원(Series), 2차원(DataFrame)만 지원한다.

In [9]:
# Series Class : 1차원 - 인덱스(index) + 값(value)
# DataFrame Class : 2차원 - 표와 같은 형태(index + columns + values)

In [15]:
name_list = ["영희", "철수", "민수"]
s2 = pd.Series(name_list, name = "이름") # 저장 => 대입
s2.name

s2.name = "네임"
s2.name


# 왜 name을 설정하는것일까? 
# 1) 데이터의 명확성
# 2) 해당 시리즈를 다른 시리즈와 병합했을 때, name 값이 컬럼 이름이 된다. => 다른 시리즈와 구별 가능.

'네임'

# DataFrame

In [ ]:
# 딕셔너리 기반
data = {
    "이름": ["영희", "철수", "민수"],
    "나이": [20, 21, 22],
    "성별": ["여", "남", "남"]
}
df = pd.DataFrame(data) # DataFrame 생성
display(df)

# list 기반
data2 = [
    ["영희", 20, "여"],
    ["철수", 21, "남"],
    ["민수", 22, "남"]
]
df2 = pd.DataFrame(data2, columns=["이름", "나이", "성별"]) # DataFrame 생성
display(df2)
print(df.columns)
print(df2.index)

# 두개의 차이점 
# key 값이 컬럼명 자동 연결됨
# 이중리스트 생성 : 컬럼명이 지정되지 않는다 (0,1,2.,...) => 확실하게 지정하고 싶으면, columns 파라미터를 지정한다.

#반목문에 연결되게 하고싶음
# -list변환 : list(df.columns) => Data가 list로 변환

   이름  나이 성별
0  영희  20  여
1  철수  21  남
2  민수  22  남

   이름  나이 성별
0  영희  20  여
1  철수  21  남
2  민수  22  남

Index(['이름', '나이', '성별'], dtype='object')
RangeIndex(start=0, stop=3, step=1)

In [23]:
data = {
    "이름": ["영희", "철수", "민수"],
    "파이썬": [90, 80, 70],
    "데이터베이스": [85, 75, 95]
}

data
data = pd.DataFrame(data)

display(data)

   이름  파이썬  데이터베이스
0  영희   90      85
1  철수   80      75
2  민수   70      95

NameError: name 's1' is not defined